{
  "description": [
    "Crosstalk-Adaptive Scheduling (CAS) is a suppression technique that mitigates crosstalk errors — unwanted interactions between qubits when gates are executed in parallel — by intelligently scheduling gate operations to avoid simultaneous execution on high-crosstalk qubit pairs.",
    "The method has been demonstrated on 20-qubit IBM systems, achieving up to 5.6x error reduction compared to default scheduling. The approach first characterizes crosstalk via simultaneous randomized benchmarking, then formulates scheduling as a constrained optimization problem.",
    "The key trade-off is between serialization (which avoids crosstalk but extends circuit duration, increasing decoherence) and parallelism (which minimizes duration but exposes the circuit to crosstalk). The scheduler balances these competing effects."
  ],
  "how_it_works": [
    "Characterize crosstalk between qubit pairs using simultaneous randomized benchmarking (SRB): measure how error rates change when gates are executed in parallel vs. isolation.",
    "Build a crosstalk map identifying which qubit pairs have significant crosstalk.",
    "Formulate gate scheduling as a constrained optimization: minimize total circuit duration subject to the constraint that high-crosstalk gate pairs are not executed simultaneously.",
    "Apply the optimized schedule to the circuit, serializing only the operations that would cause significant crosstalk.",
    "Execute the scheduled circuit on hardware."
  ],
  "key_equations": [
    {
      "label": "Crosstalk metric",
      "latex": "\\delta_{ij} = |r_{\\text{sim}}(g_i, g_j) - r_{\\text{iso}}(g_i)| / r_{\\text{iso}}(g_i)"
    },
    {
      "label": "Scheduling objective",
      "latex": "\\min \\sum_t \\text{duration}(t) \\quad \\text{s.t.} \\quad \\forall (i,j) \\in \\text{xtalk}: \\neg(g_i \\| g_j)"
    }
  ],
  "advantages": [
    "No sampling overhead — same number of shots",
    "Directly addresses a major hardware noise source",
    "Up to 5.6x error reduction demonstrated on real hardware",
    "Compatible with all downstream mitigation techniques",
    "Characterization is efficient (polynomial in qubit count)"
  ],
  "disadvantages": [
    "Serialization increases circuit duration, adding decoherence errors",
    "Requires hardware-specific crosstalk characterization",
    "Effectiveness depends on how significant crosstalk is for the target hardware",
    "Crosstalk characteristics may drift over time, requiring recalibration"
  ],
  "use_cases": [
    "Multi-qubit circuits on superconducting processors with significant crosstalk",
    "QAOA circuits where parallel two-qubit gates cause crosstalk",
    "Preprocessing step before gate-noise mitigation (ZNE, PEC)",
    "Any hardware where simultaneous gate execution degrades fidelity"
  ]
}