{
  "diagrams": [
    {
      "src": "images/techniques/gse-workflow.png",
      "caption": "Generalized Subspace Expansion: an expanded subspace is constructed from powers of the noisy state ρ^m or error-boosted states, matrix elements are measured, and a generalized eigenvalue problem yields error-mitigated estimates."
    }
  ],
  "description": [
    "Generalized Subspace Expansion (GSE) is a unified quantum error mitigation framework that encompasses both quantum subspace expansion (QSE) and virtual distillation as special cases. The key innovation is constructing an expanded subspace that captures noise-induced deviations, enabling projection back to the physical subspace without requiring knowledge of the noise model.",
    "GSE handles three types of errors simultaneously: stochastic errors (from decoherence), coherent errors (from miscalibration), and algorithmic errors (from insufficient variational optimization). This universality makes it particularly powerful for variational quantum algorithms where multiple error sources contribute.",
    "The method works by constructing basis states from powers of the noisy density matrix (ρ, ρ², ρ³, ...) or from error-boosted states generated by amplifying noise. Measuring matrix elements of the Hamiltonian and overlap in this extended basis, then solving a generalized eigenvalue problem, yields estimates with errors suppressed by orders of magnitude."
  ],
  "how_it_works": [
    "Prepare the noisy quantum state \\(\\rho\\) on the quantum device.",
    "Construct an expanded subspace basis: either powers of the noisy state \\(\\{\\rho, \\rho^2, \\ldots, \\rho^m\\}\\) (power subspace) or states at multiple noise levels \\(\\{\\rho_1, \\rho_2, \\ldots\\}\\) (error-boosted subspace).",
    "Measure the matrix elements of the Hamiltonian \\(H_{ij} = \\text{tr}(H \\rho_i \\rho_j^\\dagger)\\) and overlap matrix \\(S_{ij} = \\text{tr}(\\rho_i \\rho_j^\\dagger)\\) in the expanded basis.",
    "Solve the generalized eigenvalue problem \\(H \\vec{c} = E S \\vec{c}\\) to find the optimal linear combination of basis states.",
    "The lowest eigenvalue \\(E\\) provides the error-mitigated energy estimate, with errors suppressed exponentially in the subspace dimension."
  ],
  "key_equations": [
    {
      "label": "Generalized eigenvalue problem (H = Hamiltonian matrix, S = overlap matrix, c = coefficients)",
      "latex": "H \\vec{c} = E \\, S \\vec{c}"
    },
    {
      "label": "Power subspace basis (ρ = noisy state, m = max power)",
      "latex": "\\mathcal{S}_{\\text{power}} = \\text{span}\\{\\rho, \\rho^2, \\ldots, \\rho^m\\}"
    },
    {
      "label": "Error-boosted subspace (λ_k = noise scale factors)",
      "latex": "\\mathcal{S}_{\\text{boost}} = \\text{span}\\{\\rho_{\\lambda_1}, \\rho_{\\lambda_2}, \\ldots, \\rho_{\\lambda_k}\\}"
    },
    {
      "label": "Error suppression",
      "latex": "\\text{Error} = O\\left(\\left(\\frac{\\lambda_2}{\\lambda_1}\\right)^m\\right) \\text{ for power subspace of dimension } m"
    }
  ],
  "advantages": [
    "Unifies QSE and virtual distillation as special cases",
    "Handles stochastic, coherent, and algorithmic errors simultaneously",
    "Noise-agnostic: no noise model or characterization required",
    "Errors suppressed by orders of magnitude with increasing subspace dimension",
    "Robust against both over- and under-parameterization in variational algorithms",
    "Theoretically grounded with clear error bounds"
  ],
  "disadvantages": [
    "Requires measuring matrix elements in the expanded subspace (additional measurements)",
    "Implementing ρ^m requires multiple copies or specific measurement protocols",
    "Generalized eigenvalue problem can be ill-conditioned for large subspaces",
    "Classical post-processing overhead increases with subspace dimension",
    "May require careful choice of subspace basis for optimal performance"
  ],
  "use_cases": [
    "Variational quantum eigensolver (VQE) for ground state energy estimation",
    "Hamiltonian simulation where multiple error sources contribute",
    "Quantum chemistry calculations requiring high accuracy",
    "Scenarios where both coherent and stochastic errors are significant",
    "Settings where noise model is unknown or difficult to characterize"
  ]
}
