{
  "description": [
    "Hybrid Error Mitigation by Restricted Evolution (HEMRE) interpolates continuously between PEC and EMRE, forming a parametric family of mitigation strategies. The key innovation is an adjustable bias tolerance parameter \\(\\Delta_{\\text{fixed}}\\) that controls which gates receive full PEC treatment and which receive the cheaper EMRE approximation.",
    "Gates whose generalized robustness is below the bias threshold are treated with EMRE (implementable approximation), while gates with higher robustness receive the full quasi-probability decomposition (PEC). This creates a spectrum of protocols: at \\(\\Delta_{\\text{fixed}} = 0\\), HEMRE reduces to PEC; as \\(\\Delta_{\\text{fixed}} \\to \\infty\\), it reduces to EMRE.",
    "HEMRE is particularly powerful in moderate-noise regimes where neither pure EMRE (too much bias) nor pure PEC (too much sampling overhead) is optimal. Numerical simulations show that HEMRE outperforms both pure methods across a wide range of noise levels, making it the most practically flexible member of this protocol family."
  ],
  "how_it_works": [
    "Set a maximum tolerable bias \\(\\Delta_{\\text{fixed}}\\) for the estimation.",
    "For each gate layer, compute the generalized robustness \\(s_i\\) and rank gates by their robustness values.",
    "Partition gates into two sets: EMRE-treated gates (low robustness, replaced with closest implementable operation) and PEC-treated gates (remaining gates receiving full quasi-probability decomposition).",
    "The partition satisfies the constraint \\(s_{\\text{incl}} \\leq \\Delta_{\\text{fixed}} + 1 - \\epsilon\\), where \\(s_{\\text{incl}}\\) is the product of robustness factors for EMRE-treated gates.",
    "Execute the hybrid circuit: for PEC-treated gates, sample from the quasi-probability decomposition; for EMRE-treated gates, use the implementable approximation directly.",
    "Weight measurement outcomes by the product of the PEC coefficients and EMRE scaling factors."
  ],
  "key_equations": [
    {
      "label": "HEMRE bias constraint (s_incl = product of EMRE robustness factors, ε = bias bound)",
      "latex": "s_{\\text{incl}} \\leq \\Delta_{\\text{fixed}} + 1 - \\epsilon"
    },
    {
      "label": "HEMRE sample complexity (γ_incl = PEC one-norm for PEC-treated gates, c = target accuracy, s = total scaling, p_fail = failure probability)",
      "latex": "M_{\\text{HEMRE}} = \\frac{2\\, s_{\\text{incl}}^2 \\, \\gamma_{\\text{incl}}^2}{(cs)^2} \\ln\\!\\left(\\frac{2}{p_{\\text{fail}}}\\right)"
    },
    {
      "label": "Interpolation property",
      "latex": "\\text{HEMRE}(\\Delta_{\\text{fixed}} = 0) = \\text{PEC}, \\quad \\text{HEMRE}(\\Delta_{\\text{fixed}} \\to \\infty) = \\text{EMRE}"
    }
  ],
  "advantages": [
    "Tunable tradeoff between sampling overhead and bias — the practitioner controls the balance",
    "Outperforms both pure EMRE and pure PEC in moderate-noise regimes",
    "Reduces sampling overhead compared to PEC while achieving lower bias than EMRE",
    "Algorithmic procedure for optimal gate partition (which gates to treat with EMRE vs. PEC)",
    "Encompasses PEC and EMRE as special cases, forming a continuous family of protocols"
  ],
  "disadvantages": [
    "Requires setting the target bias a priori (needs knowledge of acceptable error tolerance)",
    "Implementation complexity is higher than either pure EMRE or pure PEC alone",
    "Still requires full noise characterization for both decomposition types",
    "Optimal gate partitioning may require solving an optimization problem"
  ],
  "use_cases": [
    "Moderate-noise regimes (0.1%–1% error rates) where neither pure EMRE nor pure PEC is optimal",
    "Scenarios where some bias is acceptable but must be bounded",
    "Circuits with heterogeneous noise (some gates high-fidelity, some lower-fidelity)",
    "Production quantum computing workflows where the bias budget is known"
  ]
}