{
  "description": [
    "Quantum Subspace Expansion (QSE) improves noisy variational estimates by expanding the search space around a reference state obtained from the quantum device. By applying a set of excitation operators to the reference state, QSE constructs a subspace that can capture both the ideal state and noise-induced leakage directions.",
    "A generalized eigenvalue problem is solved classically within this subspace, projecting out noise artifacts and yielding an improved energy estimate. The method was originally developed for quantum chemistry (McClean et al., 2017) as an extension of the variational quantum eigensolver (VQE).",
    "QSE is particularly effective when the noise causes the quantum state to leak out of the target subspace (e.g., the ground state sector), as the expanded subspace can recapture this leakage.",
    "The method was later extended to function as a quantum error decoder (McClean et al., 2020), achieving a pseudo-threshold of approximately 50% under single-qubit depolarizing noise when applied to the [[5,1,3]] perfect code. This approach uses stochastic sampling and approximate projectors to correct logical errors without requiring syndrome measurements."
  ],
  "how_it_works": [
    "Obtain a reference state \\(|\\psi_0\\rangle\\) from a noisy quantum device (e.g., via VQE).",
    "Choose a set of expansion operators \\(\\{O_i\\}\\) (e.g., single and double excitation operators for chemistry problems).",
    "Measure the matrix elements \\(H_{ij} = \\langle \\psi_0 | O_i^\\dagger H O_j | \\psi_0 \\rangle\\) and \\(S_{ij} = \\langle \\psi_0 | O_i^\\dagger O_j | \\psi_0 \\rangle\\) on the quantum device.",
    "Solve the generalized eigenvalue problem \\(H \\vec{c} = E \\, S \\vec{c}\\) classically to obtain the improved energy \\(E\\) and coefficients \\(\\vec{c}\\)."
  ],
  "key_equations": [
    {
      "label": "Generalized eigenvalue problem",
      "latex": "\\sum_j H_{ij} c_j = E \\sum_j S_{ij} c_j"
    },
    {
      "label": "Hamiltonian matrix elements",
      "latex": "H_{ij} = \\langle \\psi_0 | O_i^\\dagger H O_j | \\psi_0 \\rangle"
    },
    {
      "label": "Overlap matrix elements",
      "latex": "S_{ij} = \\langle \\psi_0 | O_i^\\dagger O_j | \\psi_0 \\rangle"
    }
  ],
  "advantages": [
    "No noise model required",
    "Can correct for noise-induced leakage out of the target subspace",
    "Naturally integrates with VQE workflows",
    "Classical post-processing is a standard eigenvalue problem"
  ],
  "disadvantages": [
    "Requires additional quantum measurements for matrix elements",
    "Effectiveness depends on choice of expansion operators",
    "Noise in matrix element measurements can degrade the eigenvalue solution",
    "Primarily applicable to energy estimation, not general expectation values"
  ],
  "use_cases": [
    "Post-processing VQE results for quantum chemistry",
    "Correcting for state preparation errors in variational algorithms",
    "Excited state estimation via subspace diagonalization",
    "Combined with symmetry verification to constrain the subspace",
    "Quantum error decoding for encoded logical qubits (e.g., [[5,1,3]] code)"
  ]
}